/*

#include <iostream>

using namespace std;

int main(int argc, char** argv) { 
  for(int i=0; i<=100; i++){      // |  0 2 4 6 8 10                   --- 98 100 102
  	i-=2; 	                      // | -2 0 2 4 6 8                    --- 96    
    cout << i++ <<" ";            // | -2(-1)  0(1) 2(3) 4(5) 6(7) 8(9) ---96 98(100) // ilk aþmada i++ --> önce kullan sonra arttýr -2(-1)
    i+=2; 						  // |  1  2 4 6 8 10 ---        100
  }
  // çýktý : -2  0  2  4  6  8  10  12  14 (2k - 2)
  // -2  0  2  4  6  8  10  12  14  16  18  20  22  24  26  28  30  32  34  36  38  40  42  44  46  48  50  52  54  56  58  60  62  64  66  68  70  72  74  76  78  80  82  84  86  88  90  92  94  96  98
  // i nin son deðeri 102 dir.
  return 0;
}

*/

